data_assignment/foam_cases/13_deg_fine/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 101325;
//         type            totalPressure;
//         rho             rho;
//         psi             none;
//         gamma           1;
//         p0              uniform 103773.34;
//         value           uniform 103773.34;
    }
    Airfoil
    {
        type            zeroGradient;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
